import React from 'react'

const document = () => {
  return (
    <>
        <div className="bg-base-100 text-base-content p-4 flex flex-col">
            <h1 className="text-3xl font-extrabold pb-6 border-2 border-secondary">Title</h1>
            <p className='border-2 border-secondary px-10 max-h-[66vh] overflow-auto'>
                5、<br />
                提问：我也来自罗马尼亚。我知道华为在全球有很多研究中心，而且他们说不同的语言，您认为语言是否是一个障碍，
                会导致华为不同地方的人没有办法高效地沟通或分享信息？华为是怎么解决这种语言障碍的？<br /> <br />
                任总：他们喝咖啡的时候可能用的是本地语言，
                但在工作中都会使用英语，包括俄罗斯员工、阿拉伯员工、非洲员工、中国员工……都说英语。所以，我们工作中只有一个标准语言，就是英语。
                每个人的英语都讲得很好，除了我。<br /> <br />
                
                6、<br />
                提问：我来自法国。作为年轻一代，我们要不断推动技术前沿，现在做的事情可能已经被实现了。
                我们要如何推动研究前沿继续往前发展？华为在这方面做出了极大的贡献，想听听您对于科技前沿推动的看法。<br /> <br />

                任总：首先，法国在拿破仑时代确立了数学立国，所以法国的数学是很强的。我们在法国有两个数学研究所，
                一个研究拍照，拍照主要是数学，不单是物理学；另一个是拉格朗日数学中心，有的菲尔兹奖获得者在这个研究所工作，
                也有的菲尔兹奖获得者和这个研究所有合作，他们研究的是未来10-20年里计算中可能出现的数学问题，而不是着眼于眼前的问题。
                法国是一个非常有前瞻性、领袖性的国家。<br />

                第二，现在大家看到华为的产品非常漂亮，是谁给他们穿上了漂亮的衣服？我们法国和意大利的美学研究所也参与了这项工作。
                二十多年前我们在法国建立了这个美学研究所，今天大家都看到，我们的产品很漂亮，这些产品有些是在法国设计的，法国对奢侈品的理解是非常强的。
                另外，我们在意大利建了美学研究所，法国其实应该叫美术研究所。美学是一种哲学，意大利的美学所实际是研究一种美的哲学，
                是一种人因工程、营销心理学，研究人的体验的关键因素、人的心理是如何想的，再来设计产品让大众接受。我们并非完全机械地制造一个产品，
                而是对心理学、美学的研究和推导过程中来设计产品，再通过数学、物理学、电子学……来实现，做出好的产品，才能适销对路，对世界做出贡献。<br />

                对于前瞻性的问题，从过去的工业革命到智能革命时，会产生挑战。工业革命时代的主要哲学是形而上学，是机械唯物论，产生了很多的定理、公式，
                使欧洲、日本……做出了非常多优秀的工程机械，为世界服务。未来进入信息世界，需要更高的哲学层面来研究世界的实现。我对人工智能不了解，
                尤瓦尔·赫拉利说会产生灵魂，他的书太超前了，讲的是两千年以后的事情，可能是说人工智能会产生智慧灵魂。如果人工智能可以自我再造的话，我们人类怎么办？
                前沿到底前到哪里去，我不知道。但我认为，三十年内不会出现，还是要靠人来创造这个世界，只是用人少了。<br />
            </p>
        </div>
    </>
  )
}

export default document